#coding:utf-8

# 如果x y是整数则对运算结果进行截取，只留整数部分
# 3/-6返回的是比-0.5更小的且最接近的数值-1
print "3/6 = ", 3/6
print "3/-6 = ", 3/-6

# 如果参与除法的两个数中有一个数为浮点数，结果亦为浮点数
print "3.0/6.0 = ", 3.0/6.0
print "3.0/6 = ", 3.0/6
print "3/6. = ", 3/6.

print
# // 只整除
print "3//6 = ", 3//6
print "3//-6 = ", 3//-6
print "3.0//6.0 = ", 3.0//6.0
print "3.0//6 = ", 3.0//6
print "3//6. = ", 3//6.

print

# 幂运算
print "3 ** 3 = ", 3 ** 3
print "-3 ** 2 = ", -3 ** 2  # 幂运算符比取反运算符（一元运算符）的优先级要高。等同于 -(3 ** 2)
print "(-3) ** 2 = ", (-3) ** 2